app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'NC-17', 'PG', 'PG-13', 'R') ORDER BY release_date
---
  def index
    sort = params[:sort] || session[:sort]
    @all_ratings = Movie.ratings.keys
    @selected_ratings = params[:ratings] || session[:ratings] || {}

    sort_by, @title_header = {:order => :title}, 'hilite'if sort == 'title'
    sort_by, @release_date_header = {:order => :release_date}, 'hilite' if sort == 'release_date'

    session[:sort] = sort if params[:sort] != session[:sort]
    session[:ratings] = @selected_ratings if params[:ratings] != session[:ratings] and !@selected_ratings.empty?

    @movies = Movie.find_all_by_rating(@selected_ratings.keys, sort_by)

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "movies" SET "title" = 'Star Whores', "release_date" = '2013-03-02 00:00:00.000000', "updated_at" = '2013-10-06 01:33:11.745782' WHERE "movies"."id" = 14
---
  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(params[:movie])